Revit 2017 API
TextNode Members
The TextNode type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from RenderNode.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetFormattedText
 Returns an FormattedText object that contains text and associated formatting of this TextNode.
GetFormattedTextRuns |  Obsolete.
 Returns a list of separated runs of formatted text.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
BaseDirection
 Direction of the base line of the text object in model space.
Color
 The color of the text.
FontHeight
 Height [ft] of the text font, in model space.
FontName
 The name of the text font.
Height
 Height [ft] of the area of the text content in model space.
HorizontalAlignment
 Indicates default horizontal alignment of the text.
IsBold
 Indicates whether the default formatting is set to bold text.
IsForRightToLeftReading |  Obsolete.
 Indicates whether the text uses Right-To-Left reading order.
IsItalic
 Indicates whether the default formatting is set to italic text.
IsKeptReadable
 Indicates text behavior inside a rotated text object.
IsTransparent
 Indicates whether the text background is transparent or opaque.
IsUnderlined
 Indicates whether the default formatting is set to underlined text.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RenderNode.)
NodeName
 A readable name of the output node.
 (Inherited from RenderNode.)
Position
 Position of the text in model coordinates.
TabSize
 The size [ft] of the interval between tab stops, in model space.
Text
 The content of the text annotation as a plain string stripped of all formatting.
TextSize |  Obsolete.
 Height [ft] of the text in model space.
UpDirection
 Direction along the vertical axis of letters of the text object in model space.
VerticalAlignment
 Indicates default vertical alignment of the text.
Width
 Width [ft] of the area of the text content in model space.
WidthScale
 Scale applied to the width of the text.
See Also
TextNode Class
Autodesk.Revit.DB Namespace